#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-uWjZzih8pUQTggfa

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.config_bucket.random_id.this[0]: Refreshing state... [id=aPbH]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.f2_instance_new.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.f2_instance_new.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.f2_instance.aws_iam_role.this: Refreshing state... [id=main-role]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
module.f2_instance_new.aws_iam_role.this: Refreshing state... [id=f2-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
module.f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=main-instance-profile]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.f2_instance_new.aws_iam_instance_profile.this: Refreshing state... [id=f2-instance-profile]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_route53_zone.internal: Refreshing state... [id=Z0474418KLUF1M8YKY2A]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.f2_instance_new.aws_security_group.this: Refreshing state... [id=sg-0b0c2706a115cea15]
module.f2_instance.aws_security_group.this: Refreshing state... [id=sg-084f10e5da8977ef8]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.f2_instance.data.aws_subnet.self: Refreshing...
module.f2_instance_new.data.aws_subnet.self: Refreshing...
module.f2_instance_new.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-1497175691]
module.f2_instance_new.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-918024373]
module.f2_instance_new.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3714648427]
module.f2_instance_new.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2411040274]
module.f2_instance_new.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.f2_instance_new.aws_instance.this: Refreshing state... [id=i-056ad8631a72e283b]
module.f2_instance.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.f2_instance_new.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1488974477]
module.f2_instance_new.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-3670505610]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1153391225]
module.f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1085682246]
module.f2_instance.aws_instance.this: Refreshing state... [id=i-0bdb939a052debb4b]
module.f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2980093754]
module.f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2409512323]
module.f2_instance.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1676588476]
module.f2_instance.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-4081642417]
module.f2_instance_new.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-3819120690]
module.f2_instance.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-934331843]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/main-policy]
module.f2_instance_new.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/f2-policy]
module.f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=main-role-20230829053104189100000001]
module.f2_instance_new.aws_iam_role_policy_attachment.this: Refreshing state... [id=f2-role-20231007085344887300000001]
module.f2_instance_new.aws_eip.this: Refreshing state... [id=eipalloc-088e677e1afd76c95]
module.f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-0e2eced5b3f96fdd0]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
module.f2_instance_new.aws_instance.this: Drift detected (update)
module.f2_instance_new.aws_security_group_rule.allow_outbound_https: Drift detected (update)
module.f2_instance_new.aws_eip.this: Drift detected (update)
module.f2_instance_new.aws_iam_instance_profile.this: Drift detected (update)
module.f2_instance_new.aws_iam_role.this: Drift detected (update)
module.f2_instance_new.aws_iam_policy.this: Drift detected (update)
module.f2_instance_new.aws_security_group.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.f2_instance_new.aws_eip.this will be updated in-place
  ~ resource "aws_eip" "this" {
        id                   = "eipalloc-088e677e1afd76c95"
      ~ instance             = "i-056ad8631a72e283b" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # module.f2_instance_new.aws_instance.this must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:558855412466:instance/i-056ad8631a72e283b" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-056ad8631a72e283b" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-09676c665529181e9" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-230.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.230" -> (known after apply)
      ~ public_dns                           = "ec2-54-229-119-147.eu-west-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.229.119.147" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "72eb93d414d831092edf2b35cf1e56c91fd902a2" -> "6745fde059bd562dbd75553930d7ea6f690463f2"
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-045a1ec4b0b6c7ccc" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>